[
    {
      "title": "RoadBeat",
      "technologies": ["Expo", "JavaScript", "Java", "Spring Framework", "Hibernate", "Node.js"],
      "description": "RoadBeat es mi Trabajo de Fin de Grado (TFG) del ciclo superior de Desarrollo de Aplicaciones Multiplataforma. Esta app móvil mejora los viajes compartidos sincronizando música en tiempo real mediante salas de reproducción. Desarrollada en React Native para explorar tecnologías multiplataforma y aprender sobre React y sockets, también integra un backend con Spring Boot y servicios como Spotify API.",
      "githubUrl": "https://github.com/SCrbnll/RoadBeat",
      "imgUrl": "https://raw.githubusercontent.com/SCrbnll/RoadBeat/refs/heads/main/roadbeat.png",
      "previewUrl": "https://youtu.be/ZsJt--pIcPU"
    },
    {
      "title": "Porfolio",
      "technologies": ["React", "TypeScript", "Bootstrap"],
      "description": "Este mismo Porfolio que estás visualizando está desarrollado en React. Desarrollado desde cero como un proyecto de aprendizaje, ofrece una experiencia intuitiva y atractiva para los visitantes. Muestra mi experiencia y proyectos de manera sencilla y eficiente",
      "githubUrl": "https://github.com/SCrbnll/SCrbnllDev/",
      "imgUrl": "https://raw.githubusercontent.com/SCrbnll/SCrbnllDev/refs/heads/main/porfolio.png",
      "previewUrl": ""
    },
    {
      "title": "Pokédex",
      "technologies": ["Angular", "TypeScript"],
      "description": "Una Pokédex web para explorar y aprender sobre Pokémon. Desarrollada con Angular y conectada a la API gratuita de PokeApi. Interfaz intuitiva para buscar, filtrar y descubrir información detallada sobre los Pokémon.",
      "githubUrl": "https://github.com/SCrbnll/Pokedex/",
      "previewUrl": "https://scrbnll-pokedex.netlify.app/",
      "imgUrl": "https://raw.githubusercontent.com/SCrbnll/Pokedex/main/pokedex.png"
    },
    {
      "title": "Knight Fate",
      "technologies": ["Unity", "C#"],
      "description": "Knight Fate es un juego de plataformas 2D desarrollado como proyecto grupal en Unity. En esta aventura, encarnas a un caballero atrapado en una mazmorra llena de retos y enemigos únicos. Fue diseñado para aprender y aplicar habilidades en diseño de niveles, mecánicas y programación en un entorno colaborativo.",
      "githubUrl": "https://github.com/SCrbnll/KnightFate/",
      "previewUrl": "https://youtu.be/rqjld6bgV-k",
      "imgUrl": "https://raw.githubusercontent.com/SCrbnll/KnightFate/refs/heads/main/knight_fate_new.png"
    }
  ]
  